{"teaching_material": ["An Ocean\n        Apart\n        Does keeping large animals in aquariums\n        and zoos foster social benefits like education\n        and conservation, or is it unethical, sending\n        the wrong message to young minds? Read\n        what two people have to say about both sides\n        of the issue.\n        Suzanne Gendron is Executive Director of Zoological Operations and Education at Ocean Park,\n        Hong Kong.\n        1 [1] Zoos, aquariums and marine parks have\n        been widely and rightly recognised by the\n        public and by governments for their longstanding contributions to marine education and\n        protection of ocean wildlife and habitats.\n        Worldwide, good zoos and aquariums host over\n        600 million visitors each year, and in Hong\n        Kong alone, close to 5 million people visit\n        Ocean Park annually. For all these people, zoos\n        and aquariums are a resource for wildlife\n        education, motivators for environmental\n        stewardship ", "and a place for family recreation.\n        5\n        10\n        15\n        20\n        25\n        30\n        35\n        40\n        45\n        50\n        55\n        60\n        65\n        [4] A recent study by Dr Lance Miller, a\n        behavioural biologist with the San Diego Zoo,\n        demonstrated an increase in conservationrelated knowledge, attitudes and behavioural\n        intentions immediately after guests viewed a\n        dolphin show. Three months later, in the next\n        round of interviews, these guests reported that\n        they were engaging in more conservationrelated behaviour since their dolphin show\n        experience. They also retained what they had\n        learned. These findings echo those of a study\n        conducted at Ocean Park about our dolphin\n        interactive programme where, three months\n        after their participation, guests’ positive\n        attitudes towards the environment were still\n        stronger than before the programme.\n        [2] At Oce", "an Park Academy, over 35,000\n        schoolchildren participate each year in our\n        courses. They include children with special\n        financial needs and children from schools in\n        remote areas. Guests can also participate in our\n        animal encounter programme, which gives them\n        a chance to see some of Asia’s rarest animals.\n        Even our restaurants display information panels\n        which advocate wise seafood choices in support\n        of sustainable agricultural and fisheries\n        practices.\n        [5] Most Hong Kong families live in urban\n        settings, increasingly withdrawn into an\n        electronic world of computer downloads,\n        satellite media and video games. Children are\n        losing touch with nature and the animal world.\n        In a time of environmental challenges, zoos and\n        aquariums are vital links to nature and wildlife.\n        They connect real-life people and real-life\n        animals, and foster the understanding t", "hat it is\n        more important, now than ever before, to\n        conserve our natural environment.\n        [3] Polls and studies confirm that seeing living,\n        breathing animals in zoological facilities\n        inspires children and adults to care about\n        protecting marine mammals and their declining\n        ocean environments. A poll taken in 2005\n        found that the public was nearly unanimous in\n        its acclaim for the educational impact of marine\n        life parks, zoos and aquariums. Many\n        respondents agreed that the experience of seeing\n        animals in zoos could not be replicated by film\n        or television.\n        [6] Saving the planet’s biodiversity is\n        increasingly more challenging. It is through\n        good zoos and aquariums that children, families\n        and communities can meet nature’s\n        ambassadors. Through these connections, they\n        will help save the wild places and wild animals\n        so that future generations w", "ill appreciate the\n        thrill of nature.\n        PP-DSE-ENG LANG 1-A-RP–2 2Peter Singer is Professor of Bioethics at Princeton University and Laureate Professor at the University\n        of Melbourne.\n        [11] But if we are pointing the finger at Sea\n        World, we should also look more broadly at the\n        way we confine performing animals. In most\n        zoos, visitors see bored animals pacing back and\n        forth in cages, with nothing to do but wait for\n        the next meal.\n        [7] In February 2010, at the Sea World\n        amusement park in Florida, USA, a whale\n        grabbed a trainer, Dawn Brancheau, pulled her\n        underwater and thrashed about with her. By the\n        time rescuers arrived, Brancheau was dead. The\n        death of the trainer is a tragedy, and one can\n        only have sympathy for her family. But the\n        incident raises broader questions: was the attack\n        deliberate? Did the whale, nicknamed Tilly, act\n        out of stres", "s at being held captive in a sterile\n        concrete tank? Was he tired of being forced to\n        perform to amuse the crowds? Is it right to keep\n        such large animals in close confinement?\n        70\n        75\n        80\n        85\n        90\n        95\n        100\n        105\n        110\n        115\n        120\n        125\n        130\n        135\n        140\n        145\n        [12] Circuses are even worse places for animals.\n        Their living conditions are deplorable, especially\n        in travelling circuses where cages have to be\n        small so that they can go on the road. Training\n        animals to perform tricks often involves\n        starvation and cruelty. Undercover\n        investigations have repeatedly shown animals\n        [8] Tilly had been involved in two previous being beaten and given electric shocks.\n        human deaths. In one episode, a trainer fell\n        into the pool and Tilly and two other whales\n        drowned him. In another, a man who appe", "ars\n        to have entered the aquarium at night, when\n        Sea World was closed, was found dead in the\n        pool with Tilly. An autopsy showed he had a\n        bite mark. One of Tilly’s offspring, sold to an\n        amusement park in Europe, has also killed a\n        trainer, as have whales in other parks.\n        [13] Attempts to defend amusement parks and\n        circuses on the grounds that they ‘educate’\n        people about animals should not be taken\n        seriously. Such enterprises are part of the\n        entertainment industry. The most important\n        lesson they teach impressionable young minds is\n        that it is acceptable to keep animals in captivity\n        for human amusement. That is the opposite of\n        the ethical attitude that we should be seeking to\n        [9] Richard Ellis, a marine conservationist at teach children.\n        the American Museum of Natural History,\n        believes orcas (a particular species of whales)\n        are smart and would", " not do such a thing purely\n        on impulse. ‘This was premeditated,’ he said.\n        We will never know exactly what was going on\n        in Tilly’s mind, but we do know that he has\n        been in captivity since he was about two years\n        old. Orcas are social mammals, and he would\n        have been living with his mother and other\n        relatives in a group. The sudden separation\n        was probably traumatic for Tilly.\n        [14] There is no excuse for keeping wild animals\n        in amusement parks or circuses. Until our\n        governments take action, we should avoid\n        supporting places where captive wild animals\n        perform for our amusement. If the public will\n        not pay to see them, the businesses that profit\n        from keeping animals captive will not be able to\n        continue.\n        [10] Moreover, the degree of confinement in\n        aquariums is extreme, for no tank, no matter\n        how large, can come close to meeting the needs\n       ", " of animals who spend their lives in social\n        groups swimming long distances in the ocean.\n        Joyce Tischler, of the Animal Legal Defence\n        Fund, described keeping a six-tonne whale in\n        Sea World’s tanks as akin to keeping a human\n        in a bathtub for his entire life.\n        \n        1. What is the main idea of paragraph 1? Zoos, aquariums and marine parks…\nA B C D\nA. are funded by governments.\nB. are well supported by the general public.\nC. are attracting increasing numbers of visitors each year.\nD. are centres of education, conservation and entertainment.\n2. According to line 9, who are ‘these people’?\n_______________________________________________________________________________________\n3. Which meaning of ‘resource’ is closest to the meaning used in line 10?\nA B C D\nA. a country’s source of wealth or revenue\ne.g. Minerals are an important resource in Australia.\nB. a source of information or expertise\ne.g. Books are an important resource for study.\nC. a", "n ability to meet and handle a situation\ne.g. Employers will find Mary’s initiative an attractive resource.\nD. a supply of materials that can be drawn on when needed\ne.g. Low income families have fewer financial resources.\n4. From the information given in paragraph 2, name THREE ways that Ocean Park promotes wildlife education.\n(3 marks)\na) ____________________________________________________________________________________\n____________________________________________________________________________________\nb) ____________________________________________________________________________________\n____________________________________________________________________________________\nc) ____________________________________________________________________________________\n____________________________________________________________________________________\n5. ‘Wise seafood choices’ (line 21) refers to eating fish that is ...\nA B C D\nA. not endangered.\nB. clean and properly cooked.\nC. the special", " catch of the day.\nD. healthy and nutritious."], "outline": ["Certainly, here's the outline for your PowerPoint presentation in Markdown format:\n\n```markdown\n# Lesson Plan: Reading Comprehension and Critical Thinking\n\n## Objective\n- To enhance students' understanding of complex texts and their ability to identify main ideas and word meanings.\n\n## Materials\n- Provided text and questions\n\n## Lesson Steps\n\n### Warm-Up\n- Discuss the importance of reading comprehension and critical thinking in understanding complex texts.\n\n### Reading\n- Provide the student with the text and ask them to read it carefully.\n\n### Question 1\n- Ask the student to reread paragraph 1.\n- Discuss the main idea of the paragraph: Zoos, aquariums, and marine parks serve as centers of education, conservation, and entertainment.\n- Explain the correct answer choice (D) and why it is the main idea.\n\n### Question 2\n- Ask the student to locate line 9.\n- Discuss who 'these people' refers to: the visitors to zoos and aquariums mentioned in the previous sentence.\n\n### Question 3\n- Explain ", "the term 'resource' in the context of the text.\n- Provide examples of different meanings of 'resource' and discuss why option (A) is the correct meaning in this context.\n\n### Question 4\n- Ask the student to list three ways Ocean Park promotes wildlife education from paragraph 2.\n- Discuss the provided information, such as courses for schoolchildren, animal encounter programs, and advocating wise seafood choices.\n\n### Question 5\n- Explain the term 'wise seafood choices' in the context of the text.\n- Discuss why option (A) - 'not endangered' is the correct meaning in this context.\n\n### Practice\n- Provide additional reading comprehension exercises for the student to practice identifying main ideas and word meanings in different texts.\n\n### Homework\n- Assign reading assignments with comprehension questions to reinforce the skills learned during the lesson.\n\n### Review\n- In the next session, review the student's progress and address any remaining questions or concerns related to reading com", "prehension.\n```\n\nYou can use this as the starting point for creating your PowerPoint presentation."]}